; domain
(define (domain reaching-grid)
    
    (:requirements :typing :negative-preconditions :strips :equality)
    
    (:types 
        gripper - object 
        location - object
    )

    (:predicates
        (is_goal ?loc - location)
        (at ?g - gripper ?loc - location)
        (neighbors ?loc1 ?loc2 - location)
    )

    (:action move-to-location
        :parameters (?g - gripper ?from ?to - location)
        :precondition (and
            (at ?g ?from)
            (not (at ?g ?to))
            (not (is_goal ?to))
            (neighbors ?from ?to)
        )
        :effect (and
            (at ?g ?to)
            (not (at ?g ?from))
        )
    )

    (:action move-to-goal
        :parameters (?g - gripper ?from ?to - location)
        :precondition (and
            (at ?g ?from)
            (is_goal ?to)
            (not (at ?g ?to))
            (not (is_goal ?from))
            (neighbors ?from ?to)
        )
        :effect (and 
            (at ?g ?to)
        )
    )
)

; problem
(define (problem task)
	(:domain reaching-grid)
	(:objects claw - gripper loc0 loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 loc13 loc14 loc15 loc16 loc17 loc18 loc19 loc20 loc21 loc22 loc23 loc24 loc25 loc26 loc27 loc28 loc29 loc30 loc31 goal - location)
	(:init
		(is_goal goal)
		(at claw loc8)
		(neighbors loc0 loc1)
		(neighbors loc0 loc8)
		(neighbors loc1 loc0)
		(neighbors loc1 loc2)
		(neighbors loc1 loc9)
		(neighbors loc2 loc1)
		(neighbors loc2 loc3)
		(neighbors loc2 loc10)
		(neighbors loc3 loc2)
		(neighbors loc3 loc4)
		(neighbors loc3 loc11)
		(neighbors loc4 loc3)
		(neighbors loc4 loc5)
		(neighbors loc4 loc12)
		(neighbors loc5 loc4)
		(neighbors loc5 loc6)
		(neighbors loc5 loc13)
		(neighbors loc6 loc5)
		(neighbors loc6 loc7)
		(neighbors loc7 loc6)
		(neighbors loc7 loc15)
		(neighbors loc8 loc0)
		(neighbors loc8 loc9)
		(neighbors loc8 loc16)
		(neighbors loc9 loc1)
		(neighbors loc9 loc8)
		(neighbors loc9 loc10)
		(neighbors loc9 loc17)
		(neighbors loc10 loc2)
		(neighbors loc10 loc9)
		(neighbors loc10 loc11)
		(neighbors loc10 loc18)
		(neighbors loc11 loc3)
		(neighbors loc11 loc10)
		(neighbors loc11 loc12)
		(neighbors loc11 loc19)
		(neighbors loc12 loc4)
		(neighbors loc12 loc11)
		(neighbors loc12 loc13)
		(neighbors loc12 loc20)
		(neighbors loc13 loc5)
		(neighbors loc13 loc12)
		(neighbors loc13 loc21)
		(neighbors loc15 loc7)
		(neighbors loc15 loc23)
		(neighbors loc16 loc8)
		(neighbors loc16 loc17)
		(neighbors loc16 loc24)
		(neighbors loc17 loc9)
		(neighbors loc17 loc16)
		(neighbors loc17 loc18)
		(neighbors loc17 loc25)
		(neighbors loc18 loc10)
		(neighbors loc18 loc17)
		(neighbors loc18 loc19)
		(neighbors loc18 loc26)
		(neighbors loc19 loc11)
		(neighbors loc19 loc18)
		(neighbors loc19 loc20)
		(neighbors loc19 loc27)
		(neighbors loc20 loc12)
		(neighbors loc20 loc19)
		(neighbors loc20 loc21)
		(neighbors loc20 loc28)
		(neighbors loc21 loc13)
		(neighbors loc21 loc20)
		(neighbors loc21 loc29)
		(neighbors loc23 loc15)
		(neighbors loc23 loc31)
		(neighbors loc24 loc16)
		(neighbors loc24 loc25)
		(neighbors loc25 loc17)
		(neighbors loc25 loc24)
		(neighbors loc25 loc26)
		(neighbors loc26 loc18)
		(neighbors loc26 loc25)
		(neighbors loc26 loc27)
		(neighbors loc27 loc19)
		(neighbors loc27 loc26)
		(neighbors loc27 loc28)
		(neighbors loc28 loc20)
		(neighbors loc28 loc27)
		(neighbors loc28 loc29)
		(neighbors loc29 loc21)
		(neighbors loc29 loc28)
		(neighbors loc29 loc30)
		(neighbors loc30 loc29)
		(neighbors loc30 loc31)
		(neighbors loc31 loc23)
		(neighbors loc31 loc30)
		(neighbors goal loc15)
		(neighbors loc15 goal)
		
	)
	(:goal (and 
		(at claw goal))
	)
)

; plan
1. (move-to-location claw loc8 loc0)
   deleted: (at claw loc8)
   added: (at claw loc0)
   goals met: 0 of 1
2. (move-to-location claw loc0 loc1)
   deleted: (at claw loc0)
   added: (at claw loc1)
   goals met: 0 of 1
3. (move-to-location claw loc1 loc2)
   deleted: (at claw loc1)
   added: (at claw loc2)
   goals met: 0 of 1
4. (move-to-location claw loc2 loc3)
   deleted: (at claw loc2)
   added: (at claw loc3)
   goals met: 0 of 1
5. (move-to-location claw loc3 loc4)
   deleted: (at claw loc3)
   added: (at claw loc4)
   goals met: 0 of 1
6. (move-to-location claw loc4 loc5)
   deleted: (at claw loc4)
   added: (at claw loc5)
   goals met: 0 of 1
7. (move-to-location claw loc5 loc6)
   deleted: (at claw loc5)
   added: (at claw loc6)
   goals met: 0 of 1
8. (move-to-location claw loc6 loc7)
   deleted: (at claw loc6)
   added: (at claw loc7)
   goals met: 0 of 1
9. (move-to-location claw loc7 loc15)
   deleted: (at claw loc7)
   added: (at claw loc15)
   goals met: 0 of 1
10. (move-to-goal claw loc15 goal)
   added: (at claw goal)
   goals met: 1 of 1
